üìò 01 ‚Äî Creating Series and DataFrames

üü¶ 1. Importing Pandas

In [1]:
import pandas as pd

üü¶ 2. Creating a Series

2.1 From a Python list

In [ ]:
numbers = [10, 20, 30, 40, 50]
s = pd.Series(numbers)
s

0    10
1    20
2    30
3    40
4    50
dtype: int64

2.2 Setting custom index labels

In [4]:
s2 = pd.Series(numbers, index=["a", "b", "c", "d", "e"])
s2

a    10
b    20
c    30
d    40
e    50
dtype: int64

2.3 From a dictionary

In [6]:
data = {"Math": 90, "Science": 85, "History": 88}
s3 = pd.Series(data)
s3

Math       90
Science    85
History    88
dtype: int64

üü¶ 3. Creating a DataFrame

3.1 From a dictionary of lists

In [7]:
student_data = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [24, 19, 22],
    "Grade": ["A", "B", "A"]
}

df1 = pd.DataFrame(student_data)
df1

      Name  Age Grade
0    Alice   24     A
1      Bob   19     B
2  Charlie   22     A

3.2 From a list of dictionaries

In [8]:
records = [
    {"Name": "Alice", "Age": 24, "Grade": "A"},
    {"Name": "Bob", "Age": 19, "Grade": "B"},
    {"Name": "Charlie", "Age": 22, "Grade": "A"}
]

df2 = pd.DataFrame(records)
df2

      Name  Age Grade
0    Alice   24     A
1      Bob   19     B
2  Charlie   22     A

3.3 From a list of lists + custom column names

In [9]:
rows = [
    [1, "Apple", 3.5],
    [2, "Banana", 2.0],
    [3, "Orange", 4.2]
]

df3 = pd.DataFrame(rows, columns=["ID", "Fruit", "Price"])
df3

   ID   Fruit  Price
0   1   Apple    3.5
1   2  Banana    2.0
2   3  Orange    4.2

üü¶ 4. Creating DataFrame with Custom Index

In [10]:
df4 = pd.DataFrame(
    student_data,
    index=["student_1", "student_2", "student_3"]
)
df4

              Name  Age Grade
student_1    Alice   24     A
student_2      Bob   19     B
student_3  Charlie   22     A

üü¶ 5. Creating DataFrame from NumPy Array

In [11]:
import numpy as np

arr = np.array([[10, 20], [30, 40], [50, 60]])
df5 = pd.DataFrame(arr, columns=["Col1", "Col2"])
df5

   Col1  Col2
0    10    20
1    30    40
2    50    60

üü¶ 6. Adding Columns After Creation

In [12]:
df1["Passed"] = df1["Grade"].apply(lambda g: g in ["A", "B"])
df1

      Name  Age Grade  Passed
0    Alice   24     A    True
1      Bob   19     B    True
2  Charlie   22     A    True

üü¶ 7. Setting and Resetting Index

Set index

In [13]:
df6 = df1.set_index("Name")
df6

         Age Grade  Passed
Name
Alice     24     A    True
Bob       19     B    True
Charlie   22     A    True

Reset index

In [14]:
df6.reset_index()

      Name  Age Grade  Passed
0    Alice   24     A    True
1      Bob   19     B    True
2  Charlie   22     A    True

## üü¶ 8. Summary

In this section, you learned how to:

- ‚úîÔ∏è Create **Series** from lists and dictionaries  
- ‚úîÔ∏è Create **DataFrames** in multiple different ways  
- ‚úîÔ∏è Set a **custom index** for your DataFrame  
- ‚úîÔ∏è Add new columns to a DataFrame  
- ‚úîÔ∏è Perform **basic operations** to explore and modify data  

Great job! üéâ  
You're now ready to move to the next section.